{
  "blogs": [
    {
      "id": "dk-products",
      "title": "DK Products E-Commerce Website",
      "content": "### DK Products E-Commerce Website \n\n This project was developed as part of my university viva, but I treated it as a real-world product rather than just an academic submission. I chose **DK Products**, a Sri Lankan spice brand, because I wanted to work on something local and practical. The main objective was to build a complete e-commerce system that could realistically be used by a small business.I designed and developed the entire platform from scratch, handling both the frontend and backend. The system includes product and category management, image uploads, shopping cart functionality, and a secure checkout flow. I focused heavily on keeping the user experience simple and smooth, especially for users who may not be very familiar with online shopping platforms.One of the biggest challenges was managing data efficiently using MySQL. I had to carefully design table relationships for products, users, orders, and categories while also ensuring good performance. Handling form validation and image uploads securely was another important learning point, as these are critical areas in real-world applications.This project helped me gain a much deeper understanding of **full-stack development** and how different components of a system work together. More importantly, it gave me confidence in building functional systems that go beyond theory and actually solve a real problem.**Technologies Used:** PHP, MySQL, HTML, CSS, JavaScript"
    },
    {
      "id": "heybuddy",
      "title": "HeyBuddy Chat Application",
      "content": "### HeyBuddy Chat Application \n\nHeyBuddy was built as my **React Native viva project**, and the idea was to create a real-time chat application that feels familiar and modern, similar to apps people use every day. I wanted to challenge myself by working on real-time communication instead of a simple CRUD-based application. \n\nThe app supports instant messaging, user presence, typing indicators, read receipts, and media sharing. I developed the mobile application using React Native and designed the UI to be clean, responsive, and easy to use on different screen sizes. For the backend, I used PHP with MySQL and built structured APIs to handle messages, users, and chat sessions. \n\nOne of the most challenging parts of this project was handling real-time message updates efficiently. I had to optimize database queries and manage message synchronization so chats felt instant and reliable. Designing the backend APIs in a way that could scale was another important learning experience. \n\nThis project taught me how messaging systems work behind the scenes and gave me hands-on experience with **real-time systems, backend optimization, and API design**. It also improved my confidence in building complete mobile applications rather than focusing only on frontend features. \n\n**Technologies Used:** React Native, PHP, MySQL, WebSockets"
    },
    {
      "id": "lifeline",
      "title": "Lifeline Mental Health App",
      "content": "### Lifeline Mental Health App \n\nLifeline is a mental health application developed while working with **Tecxa’s Research & Development Team**. The goal of this project was to create a platform that could support mental wellbeing in schools and workplaces through technology. Unlike most academic projects, this was a professional, research-driven application with real impact. \n\nThe app includes features such as mood tracking, wellness reminders, guided counseling modules, and early warning indicators that help identify mental health risks. I contributed to UI/UX design, mobile app development, API integration, and overall system planning. A lot of emphasis was placed on accessibility and user comfort, as mental health applications require a very thoughtful design approach. \n\nWorking on Lifeline taught me how large-scale applications are built in a team environment. I learned how to collaborate with designers, researchers, and developers while following proper development workflows. It also gave me insight into building software for sensitive domains like healthcare. \n\nOur work on Lifeline received a **Merit Award at the BCS – NBQSA National ICT Awards 2024** under the *eHealth & Wellbeing* category, which was a huge milestone for the team and for me personally. \n\n**Technologies Used:** React Native, React, Node.js, Tailwind CSS, MySQL"
    },
    {
      "id": "nasa-weather",
      "title": "NASA Space Apps Challenge Weather App",
      "content": "### NASA Space Apps Challenge Weather App \n\nThis project was built for the **NASA Space Apps Challenge 2025**, where our team worked on an advanced weather forecasting application. The goal was to provide long-term and short-term weather predictions using reliable datasets and AI-based forecasting models. \n\nWe used **Prophet AI** for prediction and integrated NASA-supported weather calibration datasets to improve accuracy. The frontend was built using React, while Firebase handled authentication and real-time data updates. A major focus was on data visualization, ensuring that complex weather information was easy to understand for users. \n\nThe challenge was intense and time-limited, which pushed us to make quick yet effective technical decisions. Working under pressure helped me improve my problem-solving skills and teamwork. I was deeply involved in frontend development, data handling, and system integration. \n\nOur efforts paid off when we won **1st Place in Sri Lanka** and were nominated for the global stage. We later became the **first Sri Lankan team to reach the Top 40 Global Finalists** out of more than 1,290 teams worldwide. This project remains one of the most memorable experiences in my journey. \n\n**Technologies Used:** React, Firebase, Prophet AI, NASA APIs"
    },
    {
      "id": "smart-pos",
      "title": "SMART POS System",
      "content": "### SMART POS System \n\nThe SMART POS System was developed as part of our Software Application Development module. The objective was to build a complete Point-of-Sale system that could realistically be used by retail businesses. \n\nThe system includes billing and sales processing, inventory management, supplier tracking, stock alerts, and reporting features. I designed all UI components using **Java Swing**, focusing on clarity and ease of use. The backend logic and database operations were handled using MySQL, following object-oriented principles. \n\nOne of the key challenges was ensuring data consistency across sales, inventory, and reports. This project strengthened my understanding of **OOP concepts**, database integration, and desktop application development. \n\n**Technologies Used:** Java Swing, MySQL, OOP"
    },
    {
      "id": "montessori",
      "title": "Montessori Static Website",
      "content": "### Montessori Static Website \n\nThis project involved building a fully responsive static website for a Montessori school. The main goal was to create a friendly and welcoming online presence for parents who are exploring early-childhood education options. \n\nThe website showcases the school’s services, facilities, staff, and enrollment details. I focused heavily on clean layouts, readability, and responsive design so the site works well on both desktop and mobile devices. \n\nThis project helped me improve my frontend fundamentals and attention to detail in UI design. \n\n**Technologies Used:** HTML, CSS, JavaScript, PHP"
    },
    {
      "id": "unilink",
      "title": "UniLink University App",
      "content": "### UniLink University App \n\nUniLink is a university-focused application designed to improve communication between students and lecturers. Students can book academic sessions, chat with lecturers using a WhatsApp-like interface, and manage schedules. The system also includes a React-based admin dashboard. \n\nThis project won **1st Place at Hacktivate 2025 by NSBM Green University**, and it was a great example of combining usability with real academic needs. \n\n**Technologies Used:** React Native, React, Node.js, Firebase"
},
    {
      "id": "smart-drone",
      "title": "Smart Drone Pod App",
      "content":"### Smart Drone Pod App \n\nThis project was part of a research initiative in my degree program, where I led an **8-member team** to build a mobile application for managing a smart drone delivery pod in high-rise buildings. \n\nThe pod allows drones to land safely, store deliveries such as food or medical supplies, and maintain the correct internal temperature until users collect their items. The app controls pod door automation, delivery tracking, drone coordination, and real-time IoT sensor monitoring. \n\nI handled the complete UI/UX design and mobile app development while also managing the team. This project significantly improved my leadership skills and understanding of IoT-integrated systems. \n\n**Technologies Used:** React Native, Node.js, IoT Systems, Team Leadership"
    }
  ]
}
